# num = int(input("write any number: "))
# sum = 1

# for i in range(1,num + 1):
#     sum = sum * i
# print("total", sum)


# % აბრუნებს ნაშთს ერთი რიცხვის მეორეზე გაყოფის დროს
# print(15 % 4)
      
# რიცხვის ლუწობა/კენტობის შესამოწმებლად
# თუ ნაშთი არის 0 → რიცხვი ლუწია თუ ნაშთი არის 1 → რიცხვი კენტია

# num = int(input(">"))

# if num % 2 == 0 :
#     print("even")
# else:
#     print("odd")

# ასევე გამოიყენება ციკლების პატერნაციისთვის-ანუ ერთი და იგივე ქმედება,
#  მოვლენა ან სტრუქტურა ბევრჯერ მეორდება ზუსტად ერთნაირი წესით.
# for i in range(1,5):
#     print("*" * i)


# მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ შემოტანილი რიცხვიდან ყველა გამყოფი,
#  ანუ ისეთი რიცხვები რომლებზეც შემოტანილი რიცხვი უნაშთოდ იყოფა

number = int(input("write any number: "))

for i in range(1,number + 1):
    if number % i == 0:
        print(i)

