#print- არის ფუნქცია  ხოლო Print ფუნქციაში მოთავსებული ბრძანების გამოსაძახებლად გვჭირდება ფრჩხილები
name="mari"
print(name)
#დეკლარაცია არის იგივე ცვლადის შექმნა
number="10"
number="20"
print(number)
#დასაწყისში როდესაც მხოლოდ number="10" დავბეჭდეთ print ფუნქციის დახმარებით terminal-ში გამოჩნდა 10, ხოლო როდესაც number="20"
# დავბეჭდეთ print ფუნქციის დახმარებით terminal-ში 10-ის მაგივრად გამოჩნდა 20, ვფიქრობ ამის მიზეზი ისაა რომ 
#ერთ ცვლადის სახელს შეუძლია ერთი მნიშვნელობა შეინახოს და არა რამოდენიმე